[
  {
    "type": "post",
    "author": "Dominic Briggs",
    "handle": "Co-Founder & Managing Partner at Blockwall",
    "avatar": "https://media.licdn.com/dms/image/v2/D4E03AQGwDr3z3z3z3w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1700000000000?e=1712188800&v=beta&t=placeholder",
    "content": "Dear Founders, Investors, and Friends,\n\nThe crypto landscape is full of signals worth watching. U.S. spot Bitcoin ETFs have seen over $2.9 billion in net outflows across the past 12 trading days, averaging $243 million daily since January 16. This institutional de-risking aligns with Bitcoin's 26% price drop to around $70,000, its lowest since November 2024, forming a bearish inverse cup-and-handle pattern that points to potential downside toward $65,000 or $60,000.\n\nOn the regulatory front, law enforcement's crypto tracing capabilities are sharpening. Incognito Market creator Rui-Siang Lin just received a 30-year prison sentence after the FBI tracked transactions from the online drug market straight to him.\n\nYet tokenization marches on in traditional sectors. Developer Hongkong Land launched a $6.5 billion Singapore real estate fund, the country's largest, under CEO Michael Smith's pivot to Asia's gateway cities.\n\nAt Blockwall, we stay focused on resilient Web3 builders like our portfolio companies Spiko and Validation Cloud, who deliver regulated tokenized treasuries and enterprise-grade infrastructure amid market volatility.\n\nWhat trends are you tracking to navigate this cycle?\n\n#Web3 #Crypto #Blockchain #CryptoVC",
    "url": "https://www.linkedin.com/feed/update/urn:li:activity:7291234567890123460",
    "date": "2026-02-05"
  },
  {
    "type": "post",
    "author": "Dominic Briggs",
    "handle": "Co-Founder & Managing Partner at Blockwall",
    "avatar": "https://media.licdn.com/dms/image/v2/D4E03AQGwDr3z3z3z3w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1700000000000?e=1712188800&v=beta&t=placeholder",
    "content": "Dear Founders, Investors, and Friends,\n\nThe crypto landscape is evolving rapidly, and three developments this week highlight why we're more committed than ever to backing bold Web3 builders.\n\nFirst, TRM Labs just hit a $1 billion valuation with a $70 million funding round. This isn't just a number, it's validation that institutional-grade compliance infrastructure is essential. As blockchain analytics tools become standard for financial institutions and law enforcement, the message is clear: trust and transparency drive adoption.\n\nSecond, the SEC has released new guidance on digital asset disclosure obligations. Clear rules create level playing fields and unlock institutional capital that was previously sidelined.\n\nThird, we're witnessing institutional players like Tian Ruixiang accepting Bitcoin as equity. This signals something profound: Bitcoin and digital assets are no longer speculative experiments, they're becoming core to how institutions allocate capital and structure deals.\n\nThe infrastructure is being built. The rules are becoming clearer. The capital is flowing.\n\nWhat problem are you solving in Web3 today?\n\n#Web3 #Crypto #Blockchain #CryptoVC",
    "url": "https://www.linkedin.com/feed/update/urn:li:activity:7291234567890123459",
    "date": "2026-02-04"
  },
  {
    "type": "post",
    "author": "Dominic Briggs",
    "handle": "Co-Founder & Managing Partner at Blockwall",
    "avatar": "https://media.licdn.com/dms/image/v2/D4E03AQGwDr3z3z3z3w/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1700000000000?e=1712188800&v=beta&t=placeholder",
    "content": "The crypto market just went through another stress test. Bitcoin dropped to $77K, $2.5B in liquidations, and yet here we are—still building, still investing.\n\nWhat this cycle has taught us: fundamentals matter more than ever. The projects that survive aren't the loudest—they're the ones with real users, real revenue, and real staying power.",
    "url": "https://www.linkedin.com/feed/update/urn:li:activity:7291234567890123456",
    "date": "2026-01-30"
  }
]
